Documentation/Portfolio/Code (individual project)/Front-end/artillerytest.yml
# run this test by executing npm run loadtester artillerytest.yml in a powershell terminal

config:
  target: "http://localhost:4200/"
  phases:
  - duration: 600
    arrivalRate: 50
  - duration: 60
    arrivalRate: 5
    name: Warm up
  - duration: 120
    arrivalRate: 5
    rampTo: 50
    name: Ramp up load
  - duration: 600
    arrivalRate: 50
    name: Sustained load
  ensure:
    maxErrorRate: 1
    max: 500

scenarios:
  - name: "Get product"
    flow:
      - get:
          url: "/products/detail/1"